---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeVertex.BendAngle
source: html/b1007d78-3a5f-6ee1-9a7c-67142e707ba2.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeVertex.BendAngle Property

The range of permissible angles at this bend.

## Syntax (C#)
```csharp
public RebarShapeBendAngle BendAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration